In [ ]:
# At ABC Company, each year every employee is given a percentage based increment to their salaries based on the departments they belong to. You have to write a script(s) using a scripting language (for example Python) to read from flat_data.csv and store into employees and department DB tables in the schema below. Furthermore you need to read tables from the database, calculate the updated salaries and write them back. Please note that you will need to create these tables using script or DDL and provide your code.

# The database contains the following schemas:

# employee: id :: UUID, 
# first_name::Text, 
# last_name::Text, 
# salary::numeric, 
# department_id::UUID
# department: id::UUID, 
# name::Text, 
# salary_increment::numeric
# The salary_increment column in department contains the percentage value for calculating the salary. The output of the process should be the following table

# updated_salaries: employee_id, updated_salary
# All the tables must be created by script and have the necessary key relationships between them.

# Completion
# When you are finished (or out of time) you will push up the application to a git repo. Then please notify Rais Mohammad via email (rais@pumpjackdataworks.com) with the subject Pumpjack Data Analyst Code Challenge and the link to the github repo.

In [307]:
import pandas as pd

data = pd.read_csv(
    'flat_data.csv', #file
    header=None, # create columns in arrary notation
    skiprows=1 #skip first line of file
    )
df = pd.DataFrame(data[0].str.split(',').tolist()) #split quotes text by commas
df[2] = pd.to_numeric(df[2]) #convert column to int64
df[4] = pd.to_numeric(df[4]) #convert column to int64
df["updated_salaries"] = ((df[2] * (df[4] / 100)) + df[2] ).astype(int)  #create new column which is the new salary after raise
df = df.rename(index=str, columns={0: "first_name", 1:"last_name", 2:"salary", 3:"dept_name",4:"salary_increment"}) #rename columns
df.to_csv("new_data.csv",index=False) #save to new csv file
df #return

   first_name last_name  salary  dept_name  salary_increment  updated_salaries
0      Darius   Mufutau    3901    Finance                10              4291
1       Tiger   Elliott    5489         IT                15              6312
2       Malik  Macaulay    5444      Sales                17              6369
3         Ali     Vance    8993  Marketing                16             10431
4     Randall    Deacon    9515         IT                15             10942
5      Josiah       Lee    8113      Sales                17              9492
6       Dante  Mohammad    8446      Sales                17              9881
7       Wyatt     Kuame    4817  Marketing                16              5587
8       Quinn    Oliver    5513    Finance                10              6064
9      Oliver      Gary    5158         IT                15              5931
10      Thane    Phelan    4957      Sales                17              5799
11     Walter    Lester    3864    Finance                10              4250
12     Samson     Dolan    6855         IT                15              7883
13       Beck    Walker    7077      Sales                17              8280
14      Lucas  Marshall    7499  Marketing                16              8698
15       John      Nash    4269         IT                15              4909
16    Quinlan   Elliott    7503      Sales                17              8778
17       Ivan    Dennis    4048      Sales                17              4736
18       Wang     Ronan    9319  Marketing                16             10810
19      Stone   Jameson    9354    Finance                10             10289
20    Clayton    Jarrod    4102         IT                15              4717
21       Cain      Sean    7353      Sales                17              8603